Revit 2027 API
PointOnEdgeEdgeIntersection Methods
The PointOnEdgeEdgeIntersection type exposes the following members.
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetEdgeReference1 | Get a copy of the first edge or curve reference.
GetEdgeReference2 | Get a copy of the second edge or curve reference.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetEdgeReference1 | Change the first edge or curve reference.
SetEdgeReference2 | Change the second edge or curve reference.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
PointOnEdgeEdgeIntersection Class
Autodesk.Revit.DB Namespace